In [3]:
import pandas as pd

In [5]:
df = pd.read_csv('students.csv')
df.head()

    id    name  age education        department
0  123    Luai   25        BA  computer science
1  331    Ziad   27       MBA              math
2  441    Taha   30        BA              math
3  221    Suha   26        BA         chemistry
4  336  Sandra   27       MBA  computer science

In [8]:
# values here is the average of the column that you selected (age in this case_)
df.pivot_table(index = 'department', columns = 'education', values = 'age')

education           BA   MBA   PhD
department
chemistry         26.0  31.0  33.0
computer science  25.0  27.0   NaN
economics         21.0  20.0  35.0
math              30.0  27.0  29.0